1cycledata.txt

 ./collectdata.py
INFO:root:Starting httpd...

INFO:root:POST request,
Path: /axis2/services/FIAPStorage
Headers:
Content-Type: text/xml charset=UTF-8
User-Agent: FIAPUploadAgent (STM32F4 MCU)
Host: 192.168.25.155
SOAPAction: "http://soap.fiap.org/data"
Content-Length: 14264



Body:
<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<ns2:dataRQ xmlns:ns2="http://soap.fiap.org/">
<transport xmlns="http://gutp.jp/fiap/2009/11/">
<body>
<pointSet id="http://bems.smartive.co.th/lido/floor1/control/mbm1/">
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy01">
<value time="2021-06-22T05:16:00+07:00">33.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy02">
<value time="2021-06-22T05:16:00+07:00">943.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy03">
<value time="2021-06-22T05:16:00+07:00">980.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy04">
<value time="2021-06-22T05:16:00+07:00">1.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy05">
<value time="2021-06-22T05:16:00+07:00">1139.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy06">
<value time="2021-06-22T05:16:00+07:00">859.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy07">
<value time="2021-06-22T05:16:00+07:00">575.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy08">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy09">
<value time="2021-06-22T05:16:00+07:00">604.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy10">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy11">
<value time="2021-06-22T05:16:00+07:00">18.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy12">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy13">
<value time="2021-06-22T05:16:00+07:00">3.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy14">
<value time="2021-06-22T05:16:00+07:00">312.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy15">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy16">
<value time="2021-06-22T05:16:00+07:00">226.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy17">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy18">
<value time="2021-06-22T05:16:00+07:00">118.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy19">
<value time="2021-06-22T05:16:00+07:00">202.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy20">
<value time="2021-06-22T05:16:00+07:00">9.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy21">
<value time="2021-06-22T05:16:00+07:00">292.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy22">
<value time="2021-06-22T05:16:00+07:00">13.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy23">
<value time="2021-06-22T05:16:00+07:00">20.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy24">
<value time="2021-06-22T05:16:00+07:00">13.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy25">
<value time="2021-06-22T05:16:00+07:00">471.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy26">
<value time="2021-06-22T05:16:00+07:00">421.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy27">
<value time="2021-06-22T05:16:00+07:00">310.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy28">
<value time="2021-06-22T05:16:00+07:00">19.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy29">
<value time="2021-06-22T05:16:00+07:00">11.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy30">
<value time="2021-06-22T05:16:00+07:00">55.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy31">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy32">
<value time="2021-06-22T05:16:00+07:00">3.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy33">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy34">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy35">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy36">
<value time="2021-06-22T05:16:00+07:00">0.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy37">
<value time="2021-06-22T05:16:00+07:00">4.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy38">
<value time="2021-06-22T05:16:00+07:00">463.20</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy39">
<value time="2021-06-22T05:16:00+07:00">2.40</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy40">
<value time="2021-06-22T05:16:00+07:00">504.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy41">
<value time="2021-06-22T05:16:00+07:00">4.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy42">
<value time="2021-06-22T05:16:00+07:00">1.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy43">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy44">
<value time="2021-06-22T05:16:00+07:00">3465.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy45">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy46">
<value time="2021-06-22T05:16:00+07:00">2949.00</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy47">
<value time="2021-06-22T05:16:00+07:00">0.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/Energy48">
<value time="2021-06-22T05:16:00+07:00">2242.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy01">
<value time="2021-06-22T05:16:00+07:00">9061566.11</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy02">
<value time="2021-06-22T05:16:00+07:00">18354402.08</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy03">
<value time="2021-06-22T05:16:00+07:00">13104658.58</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy04">
<value time="2021-06-22T05:16:00+07:00">6424959.39</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy05">
<value time="2021-06-22T05:16:00+07:00">25722435.57</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy06">
<value time="2021-06-22T05:16:00+07:00">11447798.15</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy07">
<value time="2021-06-22T05:16:00+07:00">9084383.37</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy08">
<value time="2021-06-22T05:16:00+07:00">8887.56</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy09">
<value time="2021-06-22T05:16:00+07:00">9514861.06</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy10">
<value time="2021-06-22T05:16:00+07:00">7285.63</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy11">
<value time="2021-06-22T05:16:00+07:00">461832.43</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy12">
<value time="2021-06-22T05:16:00+07:00">9999998558.98</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy13">
<value time="2021-06-22T05:16:00+07:00">15843284.60</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy14">
<value time="2021-06-22T05:16:00+07:00">5045923.32</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy15">
<value time="2021-06-22T05:16:00+07:00">16024492.73</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy16">
<value time="2021-06-22T05:16:00+07:00">2639892.88</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy17">
<value time="2021-06-22T05:16:00+07:00">15507479.51</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy18">
<value time="2021-06-22T05:16:00+07:00">2274375.22</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy19">
<value time="2021-06-22T05:16:00+07:00">4061511.63</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy20">
<value time="2021-06-22T05:16:00+07:00">5204704.06</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy21">
<value time="2021-06-22T05:16:00+07:00">6054098.01</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy22">
<value time="2021-06-22T05:16:00+07:00">4537552.78</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy23">
<value time="2021-06-22T05:16:00+07:00">280021.86</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy24">
<value time="2021-06-22T05:16:00+07:00">4949852.19</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy25">
<value time="2021-06-22T05:16:00+07:00">4938135.83</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy26">
<value time="2021-06-22T05:16:00+07:00">6752267.71</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy27">
<value time="2021-06-22T05:16:00+07:00">3247041.64</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy28">
<value time="2021-06-22T05:16:00+07:00">306580.59</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy29">
<value time="2021-06-22T05:16:00+07:00">122076.47</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy30">
<value time="2021-06-22T05:16:00+07:00">1084181.93</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy31">
<value time="2021-06-22T05:16:00+07:00">5572055.67</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy32">
<value time="2021-06-22T05:16:00+07:00">56408.92</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy33">
<value time="2021-06-22T05:16:00+07:00">4860095.62</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy34">
<value time="2021-06-22T05:16:00+07:00">35.34</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy35">
<value time="2021-06-22T05:16:00+07:00">4887093.80</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy36">
<value time="2021-06-22T05:16:00+07:00">9999999542.65</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy37">
<value time="2021-06-22T05:16:00+07:00">2264341.95</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy38">
<value time="2021-06-22T05:16:00+07:00">7197343.79</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy39">
<value time="2021-06-22T05:16:00+07:00">2258299.33</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy40">
<value time="2021-06-22T05:16:00+07:00">7891294.28</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy41">
<value time="2021-06-22T05:16:00+07:00">2281013.08</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy42">
<value time="2021-06-22T05:16:00+07:00">25517.41</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy43">
<value time="2021-06-22T05:16:00+07:00">11987.35</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy44">
<value time="2021-06-22T05:16:00+07:00">94036205.16</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy45">
<value time="2021-06-22T05:16:00+07:00">16156.51</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy46">
<value time="2021-06-22T05:16:00+07:00">76863842.81</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy47">
<value time="2021-06-22T05:16:00+07:00">9111.08</value>
</point>
<point id="http://bems.smartive.co.th/lido/floor1/control/mbm1/acc_Energy48">
<value time="2021-06-22T05:16:00+07:00">68838203.63</value>
</point>
</pointSet>
</body>
</transport>
</ns2:dataRQ>
</soapenv:Body>
</soapenv:Envelope>


192.168.25.125 - - [19/Jul/2021 14:03:54] "POST /axis2/services/FIAPStorage HTTP/1.1" 200 -